In [1]:
import pandas as pd
import numpy as np

#### Create Series

In [2]:
labels = ['a','b','c','d']
my_data = [10,20,30,40]
arr = np.array(my_data)
d = {'e':50,'f':60,'g':70,'h':80}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
pd.Series(arr, labels)

a    10
b    20
c    30
d    40
dtype: int32

In [6]:
pd.Series(d)

e    50
f    60
g    70
h    80
dtype: int64

#### Create DataFrame

In [7]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.115526  1.711966  0.133671  0.027520
B -0.810152 -0.560339  0.134381  1.366682
C -0.668684 -1.360166 -0.594182 -1.078433
D  0.692703  0.798234 -2.255317  0.343964
E  0.184057 -0.854199 -2.024568  1.516434

#### Create new column in dataframe

In [8]:
df['New'] = df['W']+df['Y']
df

          W         X         Y         Z       New
A -0.115526  1.711966  0.133671  0.027520  0.018144
B -0.810152 -0.560339  0.134381  1.366682 -0.675771
C -0.668684 -1.360166 -0.594182 -1.078433 -1.262866
D  0.692703  0.798234 -2.255317  0.343964 -1.562614
E  0.184057 -0.854199 -2.024568  1.516434 -1.840511

#### drop column temporarily

In [9]:
df.drop('New', axis=1)

          W         X         Y         Z
A -0.115526  1.711966  0.133671  0.027520
B -0.810152 -0.560339  0.134381  1.366682
C -0.668684 -1.360166 -0.594182 -1.078433
D  0.692703  0.798234 -2.255317  0.343964
E  0.184057 -0.854199 -2.024568  1.516434

In [10]:
df

          W         X         Y         Z       New
A -0.115526  1.711966  0.133671  0.027520  0.018144
B -0.810152 -0.560339  0.134381  1.366682 -0.675771
C -0.668684 -1.360166 -0.594182 -1.078433 -1.262866
D  0.692703  0.798234 -2.255317  0.343964 -1.562614
E  0.184057 -0.854199 -2.024568  1.516434 -1.840511

#### drop column permanently

In [11]:
df.drop('New', axis=1, inplace=True)

In [12]:
df

          W         X         Y         Z
A -0.115526  1.711966  0.133671  0.027520
B -0.810152 -0.560339  0.134381  1.366682
C -0.668684 -1.360166 -0.594182 -1.078433
D  0.692703  0.798234 -2.255317  0.343964
E  0.184057 -0.854199 -2.024568  1.516434

#### drop row

In [13]:
df.drop('E', axis=0)

          W         X         Y         Z
A -0.115526  1.711966  0.133671  0.027520
B -0.810152 -0.560339  0.134381  1.366682
C -0.668684 -1.360166 -0.594182 -1.078433
D  0.692703  0.798234 -2.255317  0.343964

#### Access row in column based

In [14]:
df.loc['B']

W   -0.810152
X   -0.560339
Y    0.134381
Z    1.366682
Name: B, dtype: float64

In [15]:
df.iloc[1]

W   -0.810152
X   -0.560339
Y    0.134381
Z    1.366682
Name: B, dtype: float64

#### writing different conditions

In [16]:
df[df['Z']>0]['Z']

A    0.027520
B    1.366682
D    0.343964
E    1.516434
Name: Z, dtype: float64

In [17]:
df[(df['W']>0) & (df['Z']<0)][['W','Z']]

Empty DataFrame
Columns: [W, Z]
Index: []

#### null, nan

In [18]:
d={'A':[1,2,np.nan],
   'B':[5,np.nan,np.nan],
   'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [19]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### delete nulls in dataframe

In [20]:
df.dropna()

     A    B  C
0  1.0  5.0  1

default drop is axis=0(rows)

In [21]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

drop is axis=1 (columns)

#### groupby

In [22]:
data = {'company' : ['GOO','GOO','FB','FB','TW','TW'],
        'sales' : [200,300,150,450,550,650]}
data

{'company': ['GOO', 'GOO', 'FB', 'FB', 'TW', 'TW'],
 'sales': [200, 300, 150, 450, 550, 650]}

In [23]:
df2 = pd.DataFrame(data)
df2

  company  sales
0     GOO    200
1     GOO    300
2      FB    150
3      FB    450
4      TW    550
5      TW    650

In [24]:
bycomp = df2.groupby('company')
bycomp

In [25]:
bycomp.mean()

         sales
company
FB         300
GOO        250
TW         600

In [26]:
bycomp.sum()

         sales
company
FB         600
GOO        500
TW        1200

In [27]:
bycomp.sum().loc['FB']

sales    600
Name: FB, dtype: int64

In [28]:
df2.groupby('company').max()

         sales
company
FB         450
GOO        300
TW         650

In [29]:
df2.groupby('company').min()

         sales
company
FB         150
GOO        200
TW         550

In [30]:
bycomp.std()

              sales
company
FB       212.132034
GOO       70.710678
TW        70.710678

In [31]:
bycomp.describe()

        sales
        count   mean         std    min    25%    50%    75%    max
company
FB        2.0  300.0  212.132034  150.0  225.0  300.0  375.0  450.0
GOO       2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
TW        2.0  600.0   70.710678  550.0  575.0  600.0  625.0  650.0

#### Concat

In [32]:
df1 = pd.DataFrame({"A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"],
                   "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]})
df2 = pd.DataFrame({"A":["A4","A5","A6","A7"],
                   "B":["B4","B5","B6","B7"],
                   "C":["C4","C5","C6","C7"],
                   "D":["D4","D5","D6","D7"]})
df3 = pd.DataFrame({"A":["A8","A9","A10","A11"],
                   "B":["B8","B9","B10","B11"],
                   "C":["C8","C9","C10","C11"],
                   "D":["D8","D9","D10","D11"]})

In [33]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [34]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [35]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [36]:
pd.concat([df1,df2,df3])  # default axis=0 (columns)

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [37]:
pd.concat([df1,df2,df3],axis=1)     # axis=1 (rows)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

#### Merge

In [38]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    "A":["A0","A1","A2","A3"],
                   "B":["B0","B1","B2","B3"]})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                      "C":["C0","C1","C2","C3"],
                   "D":["D0","D1","D2","D3"]})

In [39]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [40]:
pd.merge(df1,df2, how='inner')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [41]:
pd.merge(df1,df2, how='outer')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7